Revit 2027 API
ScheduleFilter Methods
The ScheduleFilter type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDoubleValue |  Gets the filter value for a filter using a double value.
GetElementIdValue |  Gets the filter value for a filter using an ElementId value.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetIntegerValue |  Gets the filter value for a filter using an integer value.
GetStringValue |  Gets the filter value for a filter using a string value.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetNullValue |  Sets the filter to have no specified value (used for HasParameter filters).
SetValue(Double) |  Set the filter value to a double.
SetValue(ElementId) |  Set the filter value to an ElementId.
SetValue(Int32) |  Set the filter value to an integer.
SetValue(String) |  Set the filter value to a string.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace